<?php
/**
 * 需要注意的是，公司名称总格是"吉"，字义要好。其数理五行应与负责人之人格五行相生，切忌公司名称五行克负责人之人格五行。
 */
$pizhu = array(
    '1' => array(
        'yili' => '大展鸿图，信用可立，无运不屈，可获成功。',
        'jx' => '吉'
    ),
    '2' => array(
        'yili' => '根基不固，摇摇欲坠，一盛一衰，劳而无获。',
        'jx' => '凶'
    ),
    '3' => array(
        'yili' => '根深蒂固，蒸蒸日上，如意吉祥，百事顺遂。',
        'jx' => '吉'
    ),
    '4' => array(
        'yili' => '坎坷前途，苦难折磨，非有毅力，难望成功。',
        'jx' => '凶'
    ),
    '5' => array(
        'yili' => '阴阳和合，生意兴隆，名利双收，后福无穷。',
        'jx' => '吉'
    ),
    '6' => array(
        'yili' => '万宝集门，天降幸运，立志奋发，得成大功。',
        'jx' => '吉'
    ),
    '7' => array(
        'yili' => '独门生意，气和志祥，排除万难，必获成功。',
        'jx' => '吉'
    ),
    '8' => array(
        'yili' => '努力发达，贯彻始终，不忘进退，可望成功。',
        'jx' => '吉'
    ),
    '9' => array(
        'yili' => '虽抱奇才，有才无命，独营无力，人财双亡。',
        'jx' => '凶'
    ),
    '10' => array(
        'yili' => '乌云遮月，暗淡无光，空费心力，徒劳无功。',
        'jx' => '凶'
    ),
    '11' => array(
        'yili' => '草木逢春，枝叶重生，稳健着实，必得人望。',
        'jx' => '吉'
    ),
    '12' => array(
        'yili' => '薄弱无力，孤立无援，外祥内难，谋事难成。',
        'jx' => '凶'
    ),
    '13' => array(
        'yili' => '天赋吉运，能得人望，善用智慧，必获成功。',
        'jx' => '吉'
    ),
    '14' => array(
        'yili' => '忍得苦难，必有后福，是成是败，唯靠坚毅。',
        'jx' => '凶'
    ),
    '15' => array(
        'yili' => '谦恭做事，外得人心，大事成就，一门兴隆。',
        'jx' => '吉'
    ),
    '16' => array(
        'yili' => '能获众望，成就大业，名利双收，盟主四方。',
        'jx' => '吉'
    ),
    '17' => array(
        'yili' => '排除万难，有贵人助，把握时机，可得成功。',
        'jx' => '吉'
    ),
    '18' => array(
        'yili' => '经商做事，顺利昌隆，如能慎始，百事亨通。',
        'jx' => '吉'
    ),
    '19' => array(
        'yili' => '成功虽早，慎防亏空，内外不合，障碍重重。',
        'jx' => '凶'
    ),
    '20' => array(
        'yili' => '心高志大，历尽艰难，焦心忧劳，迸退两难。',
        'jx' => '凶'
    ),
    '21' => array(
        'yili' => '先历困苦，后得幸福，霜雪梅花，春来怒放。',
        'jx' => '吉'
    ),
    '22' => array(
        'yili' => '秋草逢霜，怀才不遇，忧愁困苦，事不如意。',
        'jx' => '凶'
    ),
    '23' => array(
        'yili' => '旭日升天，名显四方，渐次进展，终成大业。',
        'jx' => '吉'
    ),
    '24' => array(
        'yili' => '绵绣前程，须靠努力，多用智谋，终成大业。',
        'jx' => '吉'
    ),
    '25' => array(
        'yili' => '天时地利，只欠人和，讲信修睦，即可成功。',
        'jx' => '吉'
    ),
    '26' => array(
        'yili' => '波澜起伏，千变万化，凌驾万难，必可成功。',
        'jx' => '凶带吉'
    ),
    '27' => array(
        'yili' => '一成一败，一盛一衰，唯靠谨慎，可守成功。',
        'jx' => '吉带凶'
    ),
    '28' => array(
        'yili' => '鱼临旱地，难逃恶运，此数大凶，不如更名。',
        'jx' => '凶'
    ),
    '29' => array(
        'yili' => '如龙得水，青云直上，智谋直进，才略奏功。',
        'jx' => '凶'
    ),
    '30' => array(
        'yili' => '吉凶参半，得失相伴，投机取巧，大有风险。',
        'jx' => '吉带凶'
    ),
    '31' => array(
        'yili' => '此数大吉，名利双收，渐进向上、大业成就。',
        'jx' => '吉'
    ),
    '32' => array(
        'yili' => '池中之龙，风云际会，一跃上天，成功可望。',
        'jx' => '吉'
    ),
    '33' => array(
        'yili' => '意气用事，人和必失，如能谨慎，必可昌隆。',
        'jx' => '吉'
    ),
    '34' => array(
        'yili' => '灾难不绝，难望成功，此数大凶，不如更名。',
        'jx' => '凶'
    ),
    '35' => array(
        'yili' => '中吉之数，进退保守，生意安稳，成就普通。',
        'jx' => '吉'
    ),
    '36' => array(
        'yili' => '波澜重叠，常陷穷困，动不如静，有才无命。',
        'jx' => '凶'
    ),
    '37' => array(
        'yili' => '逢凶化吉，吉人天相，风调雨顺，生意兴隆。',
        'jx' => '吉'
    ),
    '38' => array(
        'yili' => '名虽可得，利则难获，艺界发展，可望成功。',
        'jx' => '凶带吉'
    ),
    '39' => array(
        'yili' => '云开见月，虽有劳禄，光明坦途，指日可望。',
        'jx' => '吉'
    ),
    '40' => array(
        'yili' => '一盛一衰，沉浮不定，知难而退，自获天佑。',
        'jx' => '吉带凶'
    ),
    '41' => array(
        'yili' => '天赋吉运，德望兼备，继续努力，前途无限。',
        'jx' => '吉'
    ),
    '42' => array(
        'yili' => '事业不专，十九不成，专心进取，可望成功。',
        'jx' => '吉带凶'
    ),
    '43' => array(
        'yili' => '雨夜之花，外祥内苦，忍耐自重，转凶为吉。',
        'jx' => '吉带凶'
    ),
    '44' => array(
        'yili' => '虽用心计，事难遂愿，贪功好进，必招失败。',
        'jx' => '凶'
    ),
    '45' => array(
        'yili' => '杨柳遇春，绿叶发枝，冲破难关，一举成名。',
        'jx' => '吉'
    ),
    '46' => array(
        'yili' => '坎坷不平，艰难重重，若无耐心，难望有成。',
        'jx' => '凶'
    ),
    '47' => array(
        'yili' => '有贵人助，可成大业，若遇不幸，浮沉不定。',
        'jx' => '吉'
    ),
    '48' => array(
        'yili' => '美化丰实，鹤立鸡群，名利俱全，繁荣富贵。',
        'jx' => '吉'
    ),
    '49' => array(
        'yili' => '遇吉则吉，遇凶则凶，唯靠谨慎，逢凶化吉。',
        'jx' => '凶'
    ),
    '50' => array(
        'yili' => '吉凶互见，一成一败，凶中有吉，吉中有凶。',
        'jx' => '吉带凶'
    ),
    '51' => array(
        'yili' => '一成一败，浮沉不定，自重自处，可保平安。',
        'jx' => '吉带凶'
    ),
    '52' => array(
        'yili' => '草木逢春，雨过天晴，渡过难关，即获成功。',
        'jx' => '吉'
    ),
    '53' => array(
        'yili' => '盛衰参半，外祥内难，先吉后凶，先凶后吉。',
        'jx' => '吉带凶'
    ),
    '54' => array(
        'yili' => '虽倾全力，难望成功，此数大凶，最好改名。',
        'jx' => '凶'
    ),
    '55' => array(
        'yili' => '外观昌隆，内隐祸患，克服难关，开出泰运。',
        'jx' => '吉带凶'
    ),
    '56' => array(
        'yili' => '事与愿违，终难成功，欲速不达，有始无终。',
        'jx' => '凶'
    ),
    '57' => array(
        'yili' => '虽有困难，时来运转，旷野枯草，春来花开。',
        'jx' => '凶带吉'
    ),
    '58' => array(
        'yili' => '半凶半吉，浮沉多端，始凶终吉，能保成功。',
        'jx' => '凶带吉'
    ),
    '59' => array(
        'yili' => '遇事猜疑，难望成功，大刀阔斧，始可有成。',
        'jx' => '凶'
    ),
    '60' => array(
        'yili' => '黑暗无光，心迷意乱，出尔反尔，难定方针。',
        'jx' => '凶'
    ),
    '61' => array(
        'yili' => '云遮暗月，内隐风波，应有谨慎，始保平安。',
        'jx' => '吉带凶'
    ),
    '62' => array(
        'yili' => '烦闷懊恼，事业难展，自防灾祸，始免困境。',
        'jx' => '凶'
    ),
    '63' => array(
        'yili' => '万物化育，繁荣之象，专心一意，心能成功。',
        'jx' => '吉'
    ),
    '64' => array(
        'yili' => '见异思迁，十九不成，徒劳无功，不如更名。',
        'jx' => '凶'
    ),
    '65' => array(
        'yili' => '吉运自来，能享盛名，把握时机，必获成功。',
        'jx' => '吉'
    ),
    '66' => array(
        'yili' => '黑夜漫长，进退维谷，内外不和，信用缺乏。',
        'jx' => '凶'
    ),
    '67' => array(
        'yili' => '独营事业，事事如急，功成名就，富贵自来。',
        'jx' => '吉'
    ),
    '68' => array(
        'yili' => '思虑周详，量力而行，不失先机，可望成功。',
        'jx' => '吉'
    ),
    '69' => array(
        'yili' => '动摇不定，常陷逆境，不得时运，难得利润。',
        'jx' => '凶'
    ),
    '70' => array(
        'yili' => '惨淡经营，难免贫困，此数不吉，最好更名。',
        'jx' => '凶'
    ),
    '71' => array(
        'yili' => '吉凶参半，唯赖勇气，贯彻力行，始可成功。',
        'jx' => '吉带凶'
    ),
    '72' => array(
        'yili' => '利害混集，凶多吉少，得而复失，难以发达。',
        'jx' => '凶'
    ),
    '73' => array(
        'yili' => '安乐自来，自然吉祥，力行不懈，终必成功。',
        'jx' => '吉'
    ),
    '74' => array(
        'yili' => '利不及费，坐食出空，如无规矩，难望成功。',
        'jx' => '凶'
    ),
    '75' => array(
        'yili' => '吉中带凶，欲速不达，进不如守，可保安祥。',
        'jx' => '吉带凶'
    ),
    '76' => array(
        'yili' => '此数大凶，破产之象，宜速改名，以免厄运。',
        'jx' => '凶'
    ),
    '77' => array(
        'yili' => '先苦后甜，先甜后苦，如能守成，不致失败。',
        'jx' => '吉'
    ),
    '78' => array(
        'yili' => '有得有失，华而不实，须防劫财，始保安顺。',
        'jx' => '吉带凶'
    ),
    '79' => array(
        'yili' => '如走夜路，前途无光，希望不大，劳而无功。',
        'jx' => '凶'
    ),
    '80' => array(
        'yili' => '得而复失，枉费心机，守成无贪，可保安稳。',
        'jx' => '吉带凶'
    ),
    '81' => array(
        'yili' => '最极之数，还本归元，能得繁荣，大获成功。',
        'jx' => '吉'
    )
);